Documents/ОплатаЭлектросети.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОплатаЭлектросети</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСЭлектросетью</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСЭлектросетью.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСЭлектросетью</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ОплатаЭлектросети/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	РасчетыСЭлектросетьюОстатки.Ввод КАК Ввод,
    |	РасчетыСЭлектросетьюОстатки.СуммаОстаток КАК Долг
    |ИЗ
    |	РегистрНакопления.РасчетыСЭлектросетью.Остатки(, ) КАК РасчетыСЭлектросетьюОстатки
    |ГДЕ
    |	РасчетыСЭлектросетьюОстатки.СуммаОстаток > 0
    |УПОРЯДОЧИТЬ ПО
    |	Долг УБЫВ";
    Выборка = Запрос.Выполнить().Выбрать();
    Если Объект.Ввод.Пустая() И Выборка.Следующий() Тогда
        Объект.Ввод = Выборка.Ввод;
        Если Выборка.Следующий() Тогда
            Сообщить("Долг перед сетью есть по нескольким вводам —"
                + " подставлен ввод с наибольшим долгом, проверьте.");
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВводПриИзмененииНаСервере()
	Если Объект.Ввод.Пустая() Тогда
	    ДолгПоВводу = 0;
		Возврат;	
	КонецЕсли;
	ДолгПоВводу = ЭлектроУчет.ДолгСетиПоВводу(Объект.Ввод, Объект.Дата-1);
КонецПроцедуры

&НаКлиенте
Процедура ВводПриИзменении(Элемент)
	ВводПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьСуммуПоДолгу(Команда)
    ЗаполнитьСуммуПоДолгуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммуПоДолгуНаСервере()
	Если Объект.Ввод.Пустая() Тогда
        Сообщить("Сначала укажите ввод.");
        Возврат;
    КонецЕсли;
    Объект.Сумма = ЭлектроУчет.ДолгСетиПоВводу(Объект.Ввод, Объект.Дата - 1);
    Если Объект.Сумма <= 0 Тогда
        Сообщить("По этому вводу долга перед сетью нет.");
	КонецЕсли;
КонецПроцедуры
